In [1]:
import numpy as np
import pandas as pd

## Get the Data

In [2]:
data = pd.read_csv(r"C:\Users\pujit\OneDrive\Desktop\PYTHON\DATASET\titanic\Train.csv")

In [3]:
data.head(n=5)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,3.0,0.0,"O'Donoghue, Ms. Bridget",female,NaN,0.0,0.0,364856,7.750,NaN,Q,NaN,NaN,NaN
1,2.0,0.0,"Morley, Mr. Henry Samuel (""Mr Henry Marshall"")",male,39.0,0.0,0.0,250655,26.000,NaN,S,NaN,NaN,NaN
2,2.0,1.0,"Smith, Miss. Marion Elsie",female,40.0,0.0,0.0,31418,13.000,NaN,S,9,NaN,NaN
3,3.0,1.0,"Goldsmith, Mrs. Frank John (Emily Alice Brown)",female,31.0,1.0,1.0,363291,20.525,NaN,S,C D,NaN,"Strood, Kent, England Detroit, MI"
4,3.0,1.0,"McCoy, Miss. Agnes",female,NaN,2.0,0.0,367226,23.250,NaN,Q,16,NaN,NaN

In [4]:
data.columns

Index(['pclass', 'survived', 'name', 'sex', 'age', 'sibsp', 'parch', 'ticket',
       'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'],
      dtype='object')

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1009 entries, 0 to 1008
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1009 non-null   float64
 1   survived   1009 non-null   float64
 2   name       1009 non-null   object
 3   sex        1009 non-null   object
 4   age        812 non-null    float64
 5   sibsp      1009 non-null   float64
 6   parch      1009 non-null   float64
 7   ticket     1009 non-null   object
 8   fare       1008 non-null   float64
 9   cabin      229 non-null    object
 10  embarked   1008 non-null   object
 11  boat       374 non-null    object
 12  body       98 non-null     float64
 13  home.dest  582 non-null    object
dtypes: float64(7), object(7)
memory usage: 110.5+ KB

In [6]:
input_cols = ["pclass","sex","age","fare"]
output_cols = ["survived"]

In [7]:
data_new = data[input_cols+output_cols]

In [8]:
data_new.head()

   pclass     sex   age    fare  survived
0     3.0  female   NaN   7.750       0.0
1     2.0    male  39.0  26.000       0.0
2     2.0  female  40.0  13.000       1.0
3     3.0  female  31.0  20.525       1.0
4     3.0  female   NaN  23.250       1.0

## Removing null values from X_train

In [9]:
data_new =data_new.fillna(data_new["age"].mean())

In [10]:
data_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1009 entries, 0 to 1008
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   pclass    1009 non-null   float64
 1   sex       1009 non-null   object
 2   age       1009 non-null   float64
 3   fare      1009 non-null   float64
 4   survived  1009 non-null   float64
dtypes: float64(4), object(1)
memory usage: 39.5+ KB

## Labels for sex

In [11]:
from sklearn.preprocessing import LabelEncoder

In [12]:
le = LabelEncoder()

In [13]:
data_new["sex"] = le.fit_transform(data_new["sex"])

In [14]:
data_new.head()

   pclass  sex        age    fare  survived
0     3.0    0  29.838978   7.750       0.0
1     2.0    1  39.000000  26.000       0.0
2     2.0    0  40.000000  13.000       1.0
3     3.0    0  31.000000  20.525       1.0
4     3.0    0  29.838978  23.250       1.0

## Get the train data after using valueable cols

In [15]:
X_train =data_new[input_cols]
Y_train = data_new[output_cols]

## Entropy

In [16]:
def entropy(col):
    counts = np.unique(col,return_counts=True)
    N = float(col.shape[0])
    
    ent=0.0
    for i in counts[1]:
        p = i/N
        ent+=(-1.0)*(p)*(np.log2(p))
         
    return ent

## Tree from sklearn

In [17]:
from sklearn.tree import DecisionTreeClassifier

In [18]:
de = DecisionTreeClassifier(criterion="entropy",max_depth=5)

In [19]:
de.fit(X_train,Y_train)

DecisionTreeClassifier(criterion='entropy', max_depth=5)

In [20]:
pre=de.predict(X_train[input_cols].values)

In [40]:
pre[:10]

array([0., 0., 1., 1., 1., 0., 0., 1., 0., 0.])

In [21]:
de.score(X_train,Y_train)

0.8265609514370664

In [22]:
from sklearn.ensemble import RandomForestClassifier

In [23]:
rf = RandomForestClassifier(n_estimators=10,max_depth=5)

In [24]:
rf.fit(X_train,Y_train)

<ipython-input-24-70917fd5b97b>:1: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  rf.fit(X_train,Y_train)

RandomForestClassifier(max_depth=5, n_estimators=10)

In [25]:
rf.score(X_train,Y_train)

0.8453914767096135

## Get the test data

In [26]:
X_test = pd.read_csv(r"C:\Users\pujit\OneDrive\Desktop\PYTHON\DATASET\titanic\Test.csv")

In [27]:
X_test.head()

,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,"Flynn, Mr. John Irwin (""Irving"")",male,36.0,0.0,0.0,PC 17474,26.3875,E25,S,5,NaN,"Brooklyn, NY"
1,3.0,"Sage, Miss. Constance Gladys",female,NaN,8.0,2.0,CA. 2343,69.5500,NaN,S,NaN,NaN,NaN
2,1.0,"Rood, Mr. Hugh Roscoe",male,NaN,0.0,0.0,113767,50.0000,A32,S,NaN,NaN,"Seattle, WA"
3,2.0,"Gillespie, Mr. William Henry",male,34.0,0.0,0.0,12233,13.0000,NaN,S,NaN,NaN,"Vancouver, BC"
4,2.0,"Collander, Mr. Erik Gustaf",male,28.0,0.0,0.0,248740,13.0000,NaN,S,NaN,NaN,"Helsinki, Finland Ashtabula, Ohio"

In [28]:
X_test = X_test[input_cols]

## Handling null values and Labels

In [29]:
X_test = X_test.fillna(X_test['age'].mean())

In [30]:
from sklearn.preprocessing import LabelEncoder

In [31]:
le = LabelEncoder()
X_test['sex'] = le.fit_transform(X_test['sex'])

In [32]:
X_test.head()

   pclass  sex        age     fare
0     1.0    1  36.000000  26.3875
1     3.0    0  30.027422  69.5500
2     1.0    1  30.027422  50.0000
3     2.0    1  34.000000  13.0000
4     2.0    1  28.000000  13.0000

In [33]:
ans = rf.predict(X_test)

In [34]:
pred = pd.DataFrame(ans,columns=["survived"])

In [35]:
pred['survived'] = pred['survived'].astype(int)

In [36]:
pred.head()

   survived
0         1
1         0
2         0
3         0
4         0

In [37]:
pred.to_csv("Predictions.csv",index_label="Id")